LManuC/ProyectoFinal-Grupo5-VariadorDeFrecuencia/Software/LVFV_ESP32/main/io_control/mcp23017_defs.h
/**
 * @typedef MCP23017_INTCAP_t
 *
 * @brief Unión que define al registro INTCAP y los bits que lo componen.
 *
 * @details INTCAP guarda el valor del puerto al momento de haber generado la interrupción. Al leer este registro, se reinicia el estado de interrupción del chip.
 */
typedef union {
    uint8_t all;                                                            /*!< Unificación de la vaviable */
    struct {
        uint8_t ICP0 : 1;                                                    /*!< Bit 0 de INTCAP */
        uint8_t ICP1 : 1;                                                    /*!< Bit 1 de INTCAP */
        uint8_t ICP2 : 1;                                                    /*!< Bit 2 de INTCAP */
        uint8_t ICP3 : 1;                                                    /*!< Bit 3 de INTCAP */
        uint8_t ICP4 : 1;                                                    /*!< Bit 4 de INTCAP */
        uint8_t ICP5 : 1;                                                    /*!< Bit 5 de INTCAP */
        uint8_t ICP6 : 1;                                                    /*!< Bit 6 de INTCAP */
        uint8_t ICP7 : 1;                                                    /*!< Bit 7 de INTCAP */
    } bits;
} MCP23017_INTCAP_t;

/**
 * @enum mcp_port_e
 *
 * @brief Selector de puertos del MCP23017. Puede ser PORTA (0) o PORTB (1). De esta manera el usuario se abtrae en conocer como se llaman los registros del chip, solo con las funciones específicas de lectura y escritura, datos, pines y esta definición de puerto.
 */
enum mcp_port_e {
    PORTA = 0,                                                              /*!< Puerto A del MCP23017 */
    PORTB = 1                                                               /*!< Puerto B del MCP23017 */
};

#endif